tiborsimon/embedded-tdd-headers/pic/8bit/pic18f47j13_tdd.h
#define T2OUTPS2                      1649
#define T2OUTPS3                      1650
#define WM0                           1651
#define PR2                           1652
#define WM1                           1653
#define WAIT0                         1654
#define WAIT1                         1655
#define EBDIS                         1656
#define TMR2                          1657
#define T1CON                         1658
#define TMR1ON                        1659
#define T1CON_RD16                    1660
#define NOT_T1SYNC                    1661
#define nT1SYNC                       1662
#define T1OSCEN                       1663
#define SOSCEN                        1664
#define T1CKPS0                       1665
#define T1CKPS                        1666
#define T1CKPS1                       1667
#define TMR1CS0                       1668
#define TMR1CS                        1669
#define T1RD16                        1670
#define TMR1CS1                       1671
#define TMR1L                         1672
#define TMR1H                         1673
#define RCON                          1674
#define BOR                           1675
#define NOT_BOR                       1676
#define nBOR                          1677
#define POR                           1678
#define nPOR                          1679
#define NOT_POR                       1680
#define PD                            1681
#define nPD                           1682
#define NOT_PD                        1683
#define nTO                           1684
#define TO                            1685
#define NOT_TO                        1686
#define nRI                           1687
#define NOT_RI                        1688
#define RI                            1689
#define NOT_CM                        1690
#define CM                            1691
#define nCM                           1692
#define IPEN                          1693
#define CM2CON                        1694
#define CM2CON_CCH                    1695
#define CM2CON_CCH0                   1696
#define CCH02                         1697
#define CCH12                         1698
#define CM2CON_CCH1                   1699
#define CM2CON_CREF                   1700
#define CREF2                         1701
#define CM2CON_EVPOL                  1702
#define EVPOL02                       1703
#define CM2CON_EVPOL0                 1704
#define EVPOL12                       1705
#define CM2CON_EVPOL1                 1706
#define CM2CON_CPOL                   1707
#define CPOL2                         1708
#define CM2CON_COE                    1709
#define COE2                          1710
#define CM2CON_CON                    1711
#define CON2                          1712
#define CM1CON                        1713
#define CM1CON_CCH                    1714
#define C1CH0                         1715
#define CM1CON_CCH0                   1716
#define CCH01                         1717
#define CCH11                         1718
#define C1CH1                         1719
#define CM1CON_CCH1                   1720
#define CM1CON_CREF                   1721
#define CREF1                         1722
#define EVPOL01                       1723
#define CM1CON_EVPOL0                 1724
#define CM1CON_EVPOL                  1725
#define CM1CON_EVPOL1                 1726
#define EVPOL11                       1727
#define CM1CON_CPOL                   1728
#define CPOL1                         1729
#define CM1CON_COE                    1730
#define COE1                          1731
#define CM1CON_CON                    1732
#define CON1                          1733
#define OSCCON                        1734
#define SCS0                          1735
#define SCS                           1736
#define SCS1                          1737
#define OSTS                          1738
#define IRCF                          1739
#define IRCF0                         1740
#define IRCF1                         1741
#define IRCF2                         1742
#define IDLEN                         1743
#define T0CON                         1744
#define T0PS                          1745
#define T0PS0                         1746
#define T0PS1                         1747
#define T0PS2                         1748
#define PSA                           1749
#define T0SE                          1750
#define T0CS                          1751
#define T08BIT                        1752
#define TMR0ON                        1753
#define TMR0L                         1754
#define TMR0H                         1755
#define STATUS                        1756
#define C                             1757
#define CARRY                         1758
#define DC                            1759
#define ZERO                          1760
#define Z                             1761
#define OV                            1762
#define OVERFLOW                      1763
#define N                             1764
#define NEGATIVE                      1765
#define FSR2L                         1766
#define PLUSW2                        1767
#define PREINC2                       1768
#define POSTDEC2                      1769
#define POSTINC2                      1770
#define INDF2                         1771
#define FSR1L                         1772
#define PLUSW1                        1773
#define PREINC1                       1774
#define POSTDEC1                      1775
#define POSTINC1                      1776
#define INDF1                         1777
#define WREG                          1778
#define FSR0L                         1779
#define PLUSW0                        1780
#define PREINC0                       1781
#define POSTDEC0                      1782
#define POSTINC0                      1783
#define INDF0                         1784
#define INTCON3                       1785
#define INT1IF                        1786
#define INT1F                         1787
#define INT2IF                        1788
#define INT2F                         1789
#define INT3F                         1790
#define INT3IF                        1791
#define INT1E                         1792
#define INT1IE                        1793
#define INT2IE                        1794
#define INT2E                         1795
#define INT3E                         1796
#define INT3IE                        1797
#define INT1P                         1798
#define INT1IP                        1799
#define INT2IP                        1800
#define INT2P                         1801
#define INTCON2                       1802
#define RBIP                          1803
#define INT3IP                        1804
#define INT3P                         1805
#define TMR0IP                        1806
#define T0IP                          1807
#define INTEDG3                       1808
#define INTEDG2                       1809
#define INTEDG1                       1810
#define INTEDG0                       1811
#define RBPU                          1812
#define NOT_RBPU                      1813
#define nRBPU                         1814
#define INTCON                        1815
#define RBIF                          1816
#define INT0F                         1817
#define INT0IF                        1818
#define T0IF                          1819
#define TMR0IF                        1820
#define RBIE                          1821
#define INT0E                         1822
#define INT0IE                        1823
#define T0IE                          1824
#define TMR0IE                        1825
#define PEIE                          1826
#define PEIE_GIEL                     1827
#define GIEL                          1828
#define GIE_GIEH                      1829
#define GIE                           1830
#define GIEH                          1831
#define PRODL                         1832
#define PRODH                         1833
#define TABLAT                        1834
#define TBLPTRL                       1835
#define TBLPTRH                       1836
#define PCL                           1837
#define PCLATH                        1838
#define PCH                           1839
#define SP0                           1840
#define STKPTR                        1841
#define SP1                           1842
#define SP2                           1843
#define SP3                           1844
#define SP4                           1845
#define STKUNF                        1846
#define STKOVF                        1847
#define STKFUL                        1848
#define TOSL                          1849
#define TOSH                          1850

#endif // _PIC18F47J13_H_
